import re
import unicodedata
import pandas as pd

# List of conjunctions in Urdu
conjunctions = [
    'مگر', 'لیکن', 'کیونکہ', 'بلکہ', 'چنانچہ', 'گویا', 'یعنی',
    'اس لئے', 'تاہم', 'جبکہ', 'اگرچہ', 'حالانکہ', 'چونکہ', 'اگر',
    'تو', 'ورنہ', 'پھر',
    # Exclude 'اور' from conjunctions to prevent splitting
    # Exclude 'کہ' as it's often part of other words
]

# List of sentence boundary markers (unigram, bigram, trigram)
boundary_markers = [
    'ہے', 'ہیں', 'تھا', 'تھی', 'تھے', 'ہوگا', 'ہوگی', 'ہوگئے', 'ہوئیں',
    'ہوچکا', 'ہوچکی', 'گیا', 'گئی', 'گئے', 'کرے گا', 'کرے گی', 'کیا',
    'کر چکے', 'چلا گیا', 'دے دیا', 'لگ گیا', 'کرتے ہیں',
    'رکھا ہے', 'لیا', 'دیا', 'بن گئی', 'رکھ دی', 'کیجیے', 'کیجئے',
    'گئیں', 'تھیں', 'ہوں', 'خریدا', 'ہونگے', 'چاہیے', 'جاسکے',
    'بنیں', 'جائیں', 'چاہئے', 'کھایا', 'رہا', 'سکے', 'کرسکے',
    'حوالے کئے', 'حاصل کئے', 'کروائیں گے', 'کرچکے ہیں', 'کریں گے',
    'جائے گا', 'کیا گیا', 'جائے گی', 'کئے گئے'
]